Repository: ministryofjustice/money-to-prisoners-cashbook
Catalog: mtp_cashbook/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Only click ‘Credit to NOMIS’ when you’ve selected credits
cy: Cliciwch ‘Credydu i NOMIS’ dim ond pan fyddwch wedi dethol credydau

source: That credit cannot be manually credited
cy: Ni ellir credydu'r credyd hwnnw â llaw

source: From date
cy: Dyddiad o

source: e.g. 13/6/2017
cy: e.e. 13/6/2017

source: To date
cy: Dyddiad i

source: e.g. 15/6/2017
cy: e.e. 15/6/2017

source: The end date must be after the start date
cy: Rhaid i'r dyddiad gorffen fod ar ôl y dyddiad cychwyn

source: Name of prisoner or sender
cy: Enw'r carcharor neu'r anfonwr

source: e.g. Bob Phillips
cy: e.e. Bob Phillips

source: Prisoner number
cy: Rhif y carcharor

source: e.g. A1234AB
cy: e.e. A1234AB

source: Order by
cy: Drwy orchymyn

source: Received date (oldest to newest)
cy: Dyddiad derbyn (cynharaf i'r diweddaraf)

source: Received date (newest to oldest)
cy: Dyddiad derbyn (diweddaraf i'r cynharaf)

source: Amount sent (low to high)
cy: Swm a anfonwyd (isaf i'r uchaf)

source: Amount sent (high to low)
cy: Swm a anfonwyd (uchaf i'r isaf)

source: Prisoner number (A to Z)
cy: Rhif y carcharor (A i Z)

source: Prisoner number (Z to A)
cy: Rhif y carcharor (Z i A)

source: Keywords
cy: Allweddeiriau

source: e.g. prisoner name, prisoner number or sender name
cy: e.e. enw'r carcharor, rhif y carcharor neu enw'r anfonwr

source: on %(start)s
cy: ar %(start)s

source: between %(start)s and %(end)s
cy: rhwng %(start)s a/ac %(end)s

source: since %(start)s
cy: ers %(start)s

source: up to %(end)s
cy: hyd at %(end)s

source: %(count)s credit
cy: %(count)s credyd

source: No credits found
cy: Ni chanfuwyd credydau

source: Showing %(credits)s received %(date_range)s
cy: Dangos %(credits)s a gafwyd %(date_range)s

source: Showing %(credits)s received
cy: Dangos %(credits)s a gafwyd

source: Showing all %(credits)s received
cy: Dangos pob %(credits)s a gafwyd

source: Send money to someone in prison: the prisoner’s account has been credited
cy: Anfon arian at rywun sydd yn y carchar: mae cyfrif y carcharor wedi cael ei gredydu

source: New credits
cy: Credydau newydd

source: Digital cashbook
cy: Llyfr arian digidol

source: Processed credits
cy: Credydau sydd wedi cael eu prosesu

source: Search all credits
cy: Chwilio'r holl gredydau

source: Search for “%(query)s”
cy: Chwilio am “%(query)s”

source: Process credits
cy: Prosesu credydau

source: Manage users
cy: Rheoli defnyddwyr

source: Change password
cy: Newid cyfrinair

source: Sign out %(full_name)s
cy: Allgofnodi %(full_name)s

source: This is a new service.
cy: Mae hwn yn wasanaeth newydd.

source: If you have any comments or need help please <a href="%(ticket_url)s">contact us</a>.
cy: Os oes gennych unrhyw sylwadau neu angen cymorth <a href="%(ticket_url)s">cysylltwch â ni</a>.

source: Digital cashbook now automatically connects to NOMIS
cy: Erbyn hyn, mae'r llyfr arian digidol yn cysylltu'n awtomatig â NOMIS

source: We’ve updated the cashbook so you no longer have to enter credits by hand into NOMIS.
cy: Rydym wedi diweddaru'r llyfr arian fel nad oes rhaid i chi erbyn hyn ychwanegu credydau â llaw yn NOMIS.

source: Now, when you confirm your selected credits, the cashbook will send them to NOMIS digitally.
cy: Nawr, pan fyddwch yn cadarnhau'r credydau yr ydych wedi'u dethol, bydd y llyfr arian yn eu hanfon yn ddigidol i NOMIS.

source: I understand
cy: Rwy'n deall

source: Search
cy: Chwilio

source: Dear sender,
cy: Annwyl anfonwr,

source: The payment you made - confirmation number %(ref_number)s - has now been credited to the prisoner’s account.
cy: Mae'r taliad y gwnaethoch - rhif cadarnhau %(ref_number)s - wedi cael ei gredydu i gyfrif y carcharor.

source: Payment to:
cy: Taliad at:

source: Amount paid:
cy: Swm a dalwyd:

source: Date payment made:
cy: Dyddiad gwneud y taliad:

source: Thank you for using this service.
cy: Diolch yn fawr i chi am ddefnyddio'r gwasanaeth hwn.

source: <a href="%(help_url)s">Help</a> with problems using this service or how to <a href="%(feedback_url)s">contact us</a>.
cy: <a href="%(help_url)s">Cymorth</a> gyda phroblemau wrth ddefnyddio'r gwasanaeth hwn neu sut i <a href="%(feedback_url)s">gysylltu â ni</a>.

source: Back to the service
cy: Yn ôl i'r gwasanaeth

source: Send money to someone in prison
cy: Anfon arian at rywun sydd yn y carchar

source: Help with problems using this service:
cy: Cymorth gyda phroblemau wrth ddefnyddio'r gwasanaeth hwn:

source: Leave feedback or contact us at:
cy: Gadael adborth neu gysylltu â ni yn:

source: Back to the service:
cy: Yn ôl i'r gwasanaeth:

source: Today
cy: Heddiw

source: %(days)s day ago
cy: %(days)s diwrnod yn ôl

source: Anonymous sender
cy: Anfonwr anhysbys

source: Will not be credited
cy: Ni fydd yn cael ei gredydu

source: Checked
cy: Wedi cael eu gwirio

source: Not checked
cy: Heb gael eu gwirio

source: by %(name_of_clerk)s
cy: gan %(name_of_clerk)s

source: Refunded
cy: Wedi'i ad-dalu

source: Not credited
cy: Heb ei gredydu

source: Date sent
cy: Dyddiad anfon

source: Prisoner
cy: Carcharor

source: Amount
cy: Swm

source: Sender
cy: Anfonwr

source: Security check
cy: Gwiriad diogelwch

source: NOMIS reference
cy: Cyfeirnod NOMIS

source: Status
cy: Statws

source: %(manual_credits)s credit needs your manual input in NOMIS
cy: Mae angen i chi fewnbynnu %(manual_credits)s â llaw yn NOMIS.

source: Print these credits
cy: Argraffu'r credydau hyn

source: Security
cy: Diogelwch

source: You need to manually put this into NOMIS:
cy: Mae'n angen i chi roi hwn â llaw yn NOMIS:

source: %(owner)s started processing this credit today:
cy: Mi ddechreuodd %(owner)s brosesu'r credyd hwn heddiw:

source: %(owner)s started processing this credit yesterday:
cy: Mi ddechreuodd %(owner)s brosesu'r credyd hwn ddoe:

source: %(owner)s started processing this credit %(processed)s:
cy: Mi ddechreuodd %(owner)s brosesu'r credyd hwn %(processed)s:

source: %(owner)s started processing this credit:
cy: Mi ddechreuodd %(owner)s brosesu'r credyd hwn:

source: Prisoner in transit
cy: Carcharor yn cael ei symud

source: Prisoner transferred to %(new_prison)s
cy: Carcharor wedi'i drosglwyddo i %(new_prison)s

source: Prisoner left this prison
cy: Mae'r carcharor wedi gadael y carchar hwn

source: Done
cy: Wedi gorffen

source: Have you entered this credit into NOMIS?
cy: Ydych chi wedi rhoi'r credyd hwn yn NOMIS?

source: Date sent:
cy: Dyddiad anfon:

source: Prisoner:
cy: Carcharor:

source: Amount:
cy: Swm:

source: Sender:
cy: Anfonwr:

source: Yes
cy: Ie

source: No, I’ll do that now
cy: Na, mi wnaf hynny nawr

source: Planning to enter these credits by hand?
cy: Ydych chi'n bwriadu nodi'r credydau hyn â llaw?

source: You no longer have to enter credits by hand into NOMIS.
cy: Nid oes rhaid i chi erbyn hyn roi credydau â llaw yn NOMIS.

source: Now when you confirm credits here they will be sent to NOMIS digitally.
cy: Nawr, pan fyddwch yn cadarnhau credydau yma byddant yn cael eu hanfon yn ddigidol i NOMIS.

source: Return to send credits to NOMIS
cy: Dychwelyd i anfon credydau i NOMIS

source: I still want to print
cy: Rwyf dal eisiau argraffu

source: Do you need to print?
cy: Ydych chi angen argraffu?

source: Did you know:
cy: Oeddech chi'n gwybod:

source: you can see the digital cashbook and NOMIS screens at the same time by changing the size of your windows
cy: gallwch weld sgrîn y llyfr arian digidol a sgrîn NOMIS ar yr un pryd drwy newid maint eich ffenestri

source: you can switch between windows using the ALT + TAB keys
cy: gallwch fynd o un sgrîn i'r llall drwy bwyso ALT + TAB

source: you can copy and paste the prisoner number from one window to the other
cy: gallwch gopïo a gludo rhif y carcharor o un ffenestr i'r llall

source: Don’t show this message again
cy: Peidiwch â dangos y neges hon eto

source: Print
cy: Argraffu

source: Cancel
cy: Canslo

source: In ascending order
cy: Trefn esgynnol

source: In descending order
cy: Trefn ddisgynnol

source: Process money sent to your prison
cy: Prosesu arian a anfonwyd i'ch carchar chi

source: This is where you process credits sent to your prison by a member of the public through the <a href="%(start_page_url)s">Send money to someone in prison</a> service.
cy: Dyma lle'r ydych yn prosesu credydau a anfonwyd i'ch carchar chi gan aelod o'r cyhoedd drwy'r <a href="%(start_page_url)s">gwasanaeth</a> Anfon arian at rywun sydd yn y carchar.

source: Sign into cashbook
cy: Mewngofnodi i'r llyfr arian

source: Easy processing
cy: Prosesu hawdd

source: Process credits automatically into NOMIS – all you need do is ‘tick and click’.
cy: Prosesu credydau yn awtomatig i NOMIS - yr unig beth sydd angen i chi ei wneud ydi 'ticio a chlicio'.

source: Simple searching
cy: Chwilio syml

source: Search credits by prisoner name, prisoner number, date and sender.
cy: Chwilio credydau am enw carcharor, rhif carcharor, dyddiad ac anfonwr.

source: CONFIDENTIAL: dispose of securely
cy: CYFRINACHOL: dylech ei ddinistrio mewn modd diogel

source: %(credited_credits)s credit sent to NOMIS
cy: %(credited_credits)s credyd a anfonwyd i NOMIS

source: View
cy: Gweld

source: %(credited_manual_credits)s credit manually input by you into NOMIS
cy: %(credited_manual_credits)s rhoddwyd y credyd â llaw gennych chi yn NOMIS

source: %(failed_credits)s credit not processed due to technical error, try again soon
cy: Ni chafodd %(failed_credits)s credyd ei brosesu oherwydd gwall technegol, rhowch gynnig arall arni

source: Why?
cy: Pam?

source: Why didn’t it work?
cy: Pam na wnaeth weithio?

source: We’re sorry but sometimes a fault in our system stops credits from being processed.
cy: Mae'n ddrwg gennym, ond weithiau mae gwall yn ein system yn atal credydau rhag cael eu prosesu.

source: Please wait a few minutes then send to NOMIS again.
cy: Arhoswch ychydig o funudau ac yna'i anfon i NOMIS eto.

source: OK
cy: Iawn

source: How?
cy: Sut?

source: These credits need your manual input to be processed.
cy: Mae angen i chi fewnbynnu'r rhain â llaw er mwyn iddynt gael eu prosesu.

source: These credits need further processing
cy: Mae angen prosesu'r credydau hyn ymhellach

source: The prisoner may be in transit, may have moved prisons or may have been released.
cy: Efallai bod y carcharor yn cael ei symud, wedi symud carchardai neu wedi cael ei ryddhau.

source: Please enter these credits into NOMIS manually, then click ‘Done’.
cy: Rhowch y credydau hyn yn NOMIS â llaw ac yna cliciwch ar 'wedi gorffen'.

source: %(owner)s started to process these credits but may not have finished
cy: %(owner)s wedi dechrau prosesu'r credydau hyn ond efallai nad yw wedi gorffen

source: %(owner)s should be processing these credits into NOMIS manually
cy: Dylai %(owner)s brosesu'r credydau hyn ar NOMIS â llaw

source: How to finish processing
cy: Sut i orffen prosesu

source: Your colleague, %(owner)s, started processing these credits yesterday.
cy: Mae eich cydweithiwr, %(owner)s, wedi dechrau prosesu'r credydau hyn ddoe.

source: To make sure they were processed successfully, please check NOMIS.
cy: Gwiriwch NOMIS er mwyn gwneud yn siwr eu bod wedi cael eu prosesu'n llwyddiannus.

source: If they have been entered correctly, just click ‘Done’ and tell %(owner)s you’ve finished processing the credits.
cy: Os ydynt wedi cael eu mewnbynnu yn gywir, cliciwch 'wedi gorffen' a dywedwch wrth %(owner)s eich bod wedi gorffen prosesu'r credydau.

source: If they have not been entered, please manually enter these credits youself, click ‘Done’ and tell %(owner)s you’ve processed these credits for them.
cy: Os nad ydynt wedi cael eu mewnbynnu, rhowch y credydau hyn i mewn eich hun â llaw, cliciwch 'wedi gorffen' a dywedwch wrth %(owner)s eich bod wedi prosesu'r credydau ar eu rhan.

source: <strong>%(new_credits)s</strong> new credit.
cy: <strong>%(new_credits)s</strong> credyd newydd.

source: You haven’t selected any to process yet.
cy: Nid ydych wedi dethol unrhyw un i'w brosesu eto.

source: credits selected for processing in NOMIS
cy: credydau wedi'u dethol i'w prosesu yn NOMIS

source: Credit to NOMIS
cy: Credydu i NOMIS

source: You don’t have to manually enter credits into NOMIS any more
cy: Nid oes rhaid i chi erbyn hyn roi credydau â llaw yn NOMIS.

source: Now when you ‘confirm’ credits, they’ll be sent digitally to NOMIS
cy: Nawr, pan fyddwch yn 'cadarnhau' credydau byddant yn cael eu hanfon yn ddigidol i NOMIS.

source: No new credits received
cy: Dim credydau newydd

source: What do I do here?
cy: Beth i'w wneud yma?

source: The credits on this page are from the <a href="%(start_page_url)s">Send money to someone in prison</a> service.
cy: Mae'r credydau sydd ar y dudalen hon o'r <a href="%(start_page_url)s">gwasanaeth</a> Anfon arian at rywun sydd yn y carchar.

source: Use this page to credit to NOMIS automatically, you no longer need to manually enter these credits.
cy: Defnyddiwch y dudalen hon i anfon credydau i NOMIS yn awtomatig, nid oes rhaid i chi bellach fewnbynnu'r credydau hyn â llaw.

source: All credits are from known senders and should be credited - if there is any concern or suspicion about a credit, it should be placed on hold after crediting and passed to security.
cy: Mae'r holl gredydau gan anfonwyr hysbys a dylid eu prosesu - os oes yna unrhyw bryder neu amheuaeth ynghylch credyd, dylid ei drosglwyddo i'r staff diogelwch.

source: How to credit
cy: Sut i gredydu

source: Review all credits for suspicious activity
cy: Adolygu'r holl gredydau am weithgarwch amheus

source: Tick all credits
cy: Ticiwch yr holl gredydau

source: Click the green ‘Credit to NOMIS’ button
cy: Cliciwch y botwm gwyrdd 'Anfon i NOMIS'

source: Place any suspicious credits on hold in NOMIS
cy: Dal unrhyw credydau amheus yn ôl yn NOMIS

source: There is no longer any need to print records.
cy: Erbyn hyn, nid oes angen argraffu cofnodion

source: Select all
cy: Dewis bob un

source: Select
cy: Dethol

source: Credit £%(amount)s to %(prisoner_name)s
cy: Rhoi £%(amount)s i %(prisoner_name)s

source: Thank you
cy: Diolch yn fawr

source: All credits have been processed
cy: Mae'r holl gredydau wedi cael eu prosesu

source: Do you want to submit only the selected credits?
cy: Ydych chi eisiau cyflwyno dim ond y credydau sydd wedi cael eu dethol?

source: No, continue processing
cy: Na, parhau i brosesu

source: A list of all processed credits you can filter.
cy: Rhestr o'r holl gredydau sydd wedi cael eu prosesu y gallwch eu hidlo.

source: These credits have already been processed in NOMIS and batched accordingly.
cy: Mae'r credydau hyn wedi cael eu prosesu yn NOMIS yn barod a'u grwpio'n briodol.

source: You can filter this list by date range.
cy: Gallwch hidlo'r rhestr hon yn ôl dyddiad.

source: Just enter the date range of the credits you want to find.
cy: Nodwch ddyddiadau'r credydau yr ydych eisiau dod o hyd iddynt.

source: Filter by
cy: Hidlo yn ôl

source: Filter list
cy: Rhestr hidlo

source: Date credited
cy: Dyddiad cafodd ei gredydu

source: Number of credits
cy: Nifer o gredydau

source: Total
cy: Cyfanswm

source: Credited by
cy: Wedi cael ei gredydu gan

source: Security notes
cy: Nodiadau diogelwch

source: Options
cy: Opsiynau

source: %(count)s note
cy: %(count)s nodyn

source: No
cy: Na

source: No credits
cy: Dim credydau

source: %(count)s credit processed on %(date)s
cy: Cafodd %(count)s credyd ei brosesu ar %(date)s

source: Total:
cy: Cyfanswm:

source: Print this page of credits
cy: Argraffwch y dudalen hon o gredydau

source: Digital cashbook is crediting to NOMIS
cy: Mae'r llyfr arian digidol yn credydu i NOMIS

source: Digital cashbook has finished crediting to NOMIS
cy: Mae'r llyfr arian digidol wedi gorffen credydu i NOMIS

source: This may take a minute or two so please don’t close this page
cy: Gall hyn gymryd munud neu ddau felly peidiwch â chau'r dudalen hon

source: Continue
cy: Parhau

source: Filter these credits
cy: Hidlo'r credydau hyn
